# Задание 1

# a = int( input('Введите первое число: '))
# b = int( input('Введите второе число: '))
#
# print('Сумма: ', a + b )
# print('Разность: ',  a - b )
# print('Умножения: ',  a * b )
# print('Деление: ',  a / b )
# print('Взятие остатка от деления: ', a % b )
# print('Возведение в степень: ',  a ** b )

# Задание 2

# pi = 3.14159
# радиус = float(input('Введите радиус окружности: '))
# l = 2 * pi * радиус
# s = pi * радиус ** 2
# print ('Длина окружности: ', l )
# print ('Площадь окружности: ', s )

# Задание 3

x1 = int(input('Введите координаты первой точки x1: '))
y1 = int(input('Введите координаты первой точки y1: '))
x2 = int(input('Введите координаты второй точки x2: '))
y2 = int(input('Введите координаты второй точки y2: '))
s = (( x2 - x1 ) ** 2 + ( y2 - y1 ) ** 2 ) ** 0.5
print ('Растояния между точками: ', s )



